In [1]:
import pandas as pd

In [2]:
a = pd.read_csv('products.csv')
b = pd.read_csv('sales.csv')

In [3]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sku            3 non-null      object
 1   name           3 non-null      object
 2   current_price  3 non-null      float64
 3   cost_price     3 non-null      int64
 4   stock          3 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 252.0+ bytes

In [4]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sku            3 non-null      object
 1   quantity_sold  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [5]:
a

    sku    name  current_price  cost_price  stock
0  A123  Item A         649.99         500    150
1  B456  Item B         699.00         550     15
2  C789  Item C         999.00         500    250

In [6]:
b

    sku  quantity_sold
0  A123             10
1  B456             35
2  C789              0

In [7]:
current_price = a['current_price']
cost_price = a['cost_price']
stock = a['stock']
quantity_sold = b['quantity_sold']

In [8]:
def rules(current_price, cost_price, stock, quantity_sold):
    new_price = current_price 
    if stock < 20 and quantity_sold > 30:
        new_price = current_price * 1.15
    elif stock > 200 and quantity_sold == 0:
        new_price = current_price * 0.7
    elif stock > 100 and quantity_sold < 20:
        new_price = current_price * 0.9

    min_price = cost_price * 1.2
    if new_price < min_price:
        new_price = min_price

    return round(new_price, 2)

In [9]:
rules(999.99,500,250,0)

699.99

In [10]:
df = pd.merge(a, b, on="sku", how="left")
df["quantity_sold"] = df["quantity_sold"].fillna(0)

In [11]:
df

    sku    name  current_price  cost_price  stock  quantity_sold
0  A123  Item A         649.99         500    150             10
1  B456  Item B         699.00         550     15             35
2  C789  Item C         999.00         500    250              0

In [12]:
df["new_price"] = df.apply(lambda row: rules(
    row["current_price"],
    row["cost_price"],
    row["stock"],
    row["quantity_sold"]
), axis=1)

In [13]:
df

    sku    name  current_price  cost_price  stock  quantity_sold  new_price
0  A123  Item A         649.99         500    150             10     600.00
1  B456  Item B         699.00         550     15             35     803.85
2  C789  Item C         999.00         500    250              0     699.30

In [14]:
df = df[["sku", "current_price", "new_price"]]
df.columns = ["sku", "old_price", "new_price"]

In [15]:
df

    sku  old_price  new_price
0  A123     649.99     600.00
1  B456     699.00     803.85
2  C789     999.00     699.30

In [16]:
df.to_csv('updated_prices.csv',index = False)